app/Controllers/Home.php

    public function index()
    {
        $genero=new GeneroModel();
        $cancionModel = new CancionModel();
        $data['generos']=$genero->findAll();
        $data['canciones']=$cancionModel->findAll();
---
SELECT *
FROM `genero`
SELECT *
FROM `cancion`

    public function getCancion($id){
        $cancionModel = new CancionModel();
        $data['canciones']=$cancionModel->find($id);
---
SELECT *
FROM `cancion`
WHERE `cancion`.`id` = '2'